espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cli/src/sl_cli_simple_password.c
/***************************************************************************//**
 * @file
 * @brief CLI simple password protection.
 * @version x.y.z
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "sl_cli_simple_password_config.h"
#include "sl_cli_simple_password.h"
#include "sl_status.h"
#include "sl_iostream.h"

#include "sl_cli.h"
#include "sl_cli_config.h"
#include "sl_cli_types.h"
#include "sl_enum.h"
#include "sl_sleeptimer.h"

#include "em_core.h"
#include "ecode.h"

#include "mbedtls/aes.h"
#include "mbedtls/md.h"
#include "psa/crypto.h"
#include "psa_crypto_storage.h"

#include "nvm3.h"

#include <ctype.h>
#include <stddef.h>
#include <stdarg.h>
#include <stdbool.h>

#define CLI_SECURITY_PSA_CRYPTO_KEY_ID                    (0x00004202)
#define CLI_SECURITY_NVM3_KEY_ID_ENCRYPTED_PASSWORD_HASH  (SL_CLI_NVM3_KEY_BEGIN)
#define CLI_SECURITY_NVM3_KEY_ID_IV                       (SL_CLI_NVM3_KEY_BEGIN + 1)
#define CLI_SECURITY_NVM3_KEY_ID_WARN_FLAG                (SL_CLI_NVM3_KEY_BEGIN + 2)
#define CLI_SECURITY_NVM3_KEY_ID_LOCK_TIMER               (SL_CLI_NVM3_KEY_BEGIN + 3)
#define CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER            (SL_CLI_NVM3_KEY_BEGIN + 4)

SL_ENUM(state_t){
  INIT = 0,
  ASK_NEW_PASSWORD,
  WAITING_NEW_PASSWORD,
  ASK_NEW_PASSWORD_CONFIRMATION,
  WAITING_NEW_PASSWORD_CONFIRMATION,
  ASK_PASSWORD,
  WAITING_PASSWORD,
  LOCKOUT,
  LOGGED_IN,
  CONFIGURE,
  CONFIGURING,
  CONFIGURED,
};

static psa_algorithm_t psa_algo = PSA_ALG_CBC_NO_PADDING;
static state_t module_state = INIT;
static sl_cli_handle_t instance_initialize_password = NULL;
static bool security_warning = false;
static bool lock_timer_running = false;
static uint8_t retry_count = 0;

#define CIPHER_BLOCK_SIZE     PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES)
#define BLOCK_SIZE   32
static uint8_t encrypted_password_hash[BLOCK_SIZE];
static uint8_t iv[CIPHER_BLOCK_SIZE];

typedef struct  {
  char buffer[SL_CLI_SIMPLE_PASSWORD_LENGTH_MAX + 1];
  char tmp_password[SL_CLI_SIMPLE_PASSWORD_LENGTH_MAX + 1];
  psa_key_id_t key_id;
  state_t state;
  uint32_t buffer_ix;
  uint8_t wrong_password_cnt;
  bool locked;
  sl_sleeptimer_timer_handle_t timer;
} cli_instance_data_session_t;

/***************************************************************************//**
 * @brief  Generate and store an encryption key
 ******************************************************************************/
static sl_status_t generate_encryption_key(psa_key_id_t * key_id)
{
  // Set key attributes.
  psa_status_t status;
  psa_key_attributes_t key_attr;

  key_attr = psa_key_attributes_init();
  psa_set_key_id(&key_attr, CLI_SECURITY_PSA_CRYPTO_KEY_ID);
  psa_set_key_algorithm(&key_attr, psa_algo);
  psa_set_key_usage_flags(&key_attr, PSA_KEY_USAGE_ENCRYPT | PSA_KEY_USAGE_DECRYPT);
  psa_set_key_type(&key_attr, PSA_KEY_TYPE_AES);
  psa_set_key_bits(&key_attr, 128);
  psa_set_key_lifetime(&key_attr, PSA_KEY_LIFETIME_FROM_PERSISTENCE_AND_LOCATION(PSA_KEY_LIFETIME_PERSISTENT, PSA_KEY_LOCATION_LOCAL_STORAGE));
  status = psa_generate_key(&key_attr, key_id);
  EFM_ASSERT(status == PSA_SUCCESS);

  psa_reset_key_attributes(&key_attr);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Encrypt/Decypt Cipher Operation
 ******************************************************************************/
static psa_status_t cipher_operation(psa_cipher_operation_t * operation,
                                     const uint8_t * input,
                                     size_t input_size,
                                     size_t part_size,
                                     uint8_t * output,
                                     size_t output_size,
                                     size_t * output_len)
{
  psa_status_t psa_status;
  size_t bytes_to_write = 0, bytes_written = 0, len = 0;

  *output_len = 0;
  while ( bytes_written != input_size ) {
    bytes_to_write = (input_size - bytes_written > part_size
                      ? part_size
                      : input_size - bytes_written);

    psa_status = psa_cipher_update(operation, input + bytes_written,
                                   bytes_to_write, output + *output_len,
                                   output_size - *output_len, &len);
    EFM_ASSERT(psa_status == PSA_SUCCESS);

    bytes_written += bytes_to_write;
    *output_len += len;
  }

  psa_status = psa_cipher_finish(operation, output + *output_len,
                                 output_size - *output_len, &len);
  EFM_ASSERT(psa_status == PSA_SUCCESS);
  *output_len += len;

  return(psa_status);
}

/***************************************************************************//**
 * @brief Encrypt Data
 ******************************************************************************/
static psa_status_t cipher_encrypt(uint8_t * iv,
                                   size_t iv_size,
                                   const uint8_t * input,
                                   size_t input_size,
                                   uint8_t * output,
                                   size_t output_size,
                                   size_t * output_len)
{
  psa_status_t psa_status;
  psa_cipher_operation_t operation = PSA_CIPHER_OPERATION_INIT;
  size_t iv_len = 0;

  if (!psa_is_key_present_in_storage(CLI_SECURITY_PSA_CRYPTO_KEY_ID)) {
    // Key has been destroyed. Generate a new one
    psa_key_id_t key_id;
    sl_status_t status = generate_encryption_key(&key_id);
    EFM_ASSERT(status == SL_STATUS_OK);
    EFM_ASSERT(key_id == CLI_SECURITY_PSA_CRYPTO_KEY_ID);
  }

  mbedtls_platform_zeroize(&operation, sizeof(operation) );
  psa_status = psa_cipher_encrypt_setup(&operation, CLI_SECURITY_PSA_CRYPTO_KEY_ID, psa_algo);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = psa_cipher_generate_iv(&operation, iv, iv_size, &iv_len);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = cipher_operation(&operation, input, input_size, BLOCK_SIZE,
                                output, output_size, output_len);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_cipher_abort(&operation);
  return(psa_status);
}

/***************************************************************************//**
 * @brief Decrypt Data
 ******************************************************************************/
static psa_status_t cipher_decrypt(const uint8_t * iv,
                                   size_t iv_size,
                                   const uint8_t * input,
                                   size_t input_size,
                                   uint8_t * output,
                                   size_t output_size,
                                   size_t * output_len)
{
  psa_status_t psa_status;
  psa_cipher_operation_t operation = PSA_CIPHER_OPERATION_INIT;

  mbedtls_platform_zeroize(&operation, sizeof(operation) );
  psa_status = psa_cipher_decrypt_setup(&operation, CLI_SECURITY_PSA_CRYPTO_KEY_ID, psa_algo);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = psa_cipher_set_iv(&operation, iv, iv_size);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = cipher_operation(&operation, input, input_size, BLOCK_SIZE,
                                output, output_size, output_len);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_cipher_abort(&operation);
  return(psa_status);
}

/***************************************************************************//**
 * @brief Validate if a provided password match the password configured
 ******************************************************************************/
static bool is_valid_password(char *password)
{
  uint8_t decrypted_hash[BLOCK_SIZE];
  size_t length;
  psa_status_t psa_status;
  psa_hash_operation_t operation;

  cipher_decrypt(iv, sizeof(iv),
                 encrypted_password_hash, sizeof(encrypted_password_hash),
                 decrypted_hash, sizeof(decrypted_hash), &length);

  length = strlen(password);
  operation = psa_hash_operation_init();

