espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cli/src/sl_cli_simple_password.c
  psa_status = psa_hash_setup(&operation, PSA_ALG_SHA_256);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = psa_hash_update(&operation, (uint8_t *)password, length);
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  psa_status = psa_hash_verify(&operation, decrypted_hash, sizeof(decrypted_hash));

  psa_hash_abort(&operation);
  mbedtls_platform_zeroize(decrypted_hash, sizeof(decrypted_hash));

  if (psa_status == PSA_SUCCESS) {
    return true;
  }

  return false;
}

/***************************************************************************//**
 * @brief Output string with Line feed (LF) on the cli instance stream
 ******************************************************************************/
static void write_string_lf(sl_cli_handle_t handle,
                            char *str)
{
  sl_iostream_write(handle->iostream_handle, str, strlen(str));
  sl_iostream_putchar(handle->iostream_handle, '\n');
}

/***************************************************************************//**
 * @brief  Read data from Terminal
 ******************************************************************************/
static sl_status_t read_until_line_feed(sl_cli_handle_t handle,
                                        cli_instance_data_session_t *session)
{
  state_t s_state;
  sl_cli_handle_t cli_init;
  sl_status_t status = SL_STATUS_OK;
  bool read = true;
  char c;

  CORE_ATOMIC_SECTION(s_state = session->state; \
                      cli_init = instance_initialize_password; );

  do {
#if defined(SL_CATALOG_KERNEL_PRESENT)
    status = sl_iostream_getchar(handle->iostream_handle, &c);
#else
    if (handle->input_char == EOF) {
      status = sl_iostream_getchar(handle->iostream_handle, &c);
    } else {
      // Char read before going to sleep by the sl_cli_is_ok_to_sleep()
      c = handle->input_char;
      handle->input_char = EOF;
    }
#endif

    if (status == SL_STATUS_EMPTY) {
      return SL_STATUS_IN_PROGRESS;
    } else if (status == SL_STATUS_OK) {
      CORE_DECLARE_IRQ_STATE;

      CORE_ENTER_ATOMIC();
      if (module_state == CONFIGURE) {
        // Start receiving password on this instance;
        // Block other instance for configuring until completed by the current instance
        module_state = CONFIGURING;
        instance_initialize_password = handle;
      }
      CORE_EXIT_ATOMIC();

      if ((c == '\n') || (c == '\r')) {  // line feed
        if (session->buffer_ix > 0) {
          read = false;
          session->buffer[session->buffer_ix] = '\0';
          sl_iostream_putchar(handle->iostream_handle, c);
          return SL_STATUS_OK;
        }
      } else if (c == '\b') { // backspace
        if (session->buffer_ix > 0) { // underflow check
          session->buffer_ix--;
        }
        // Erase char on terminal
        sl_iostream_putchar(handle->iostream_handle, '\b');
        sl_iostream_putchar(handle->iostream_handle, ' ');
        sl_iostream_putchar(handle->iostream_handle, '\b');
      } else if (session->buffer_ix == SL_CLI_SIMPLE_PASSWORD_LENGTH_MAX) {
        // Buffer overflow; restart setup
        write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_ENTRY_TOO_LONG);
        read = false;
        switch (s_state) {
          case WAITING_NEW_PASSWORD:
          case WAITING_NEW_PASSWORD_CONFIRMATION:
            CORE_ATOMIC_SECTION(session->state = INIT; );
            if (cli_init == handle) {
              CORE_ATOMIC_SECTION(instance_initialize_password = NULL; );
            }
            break;
          case WAITING_PASSWORD:
            CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; );
            break;
          default:
            EFM_ASSERT(false);
        }
        return SL_STATUS_WOULD_OVERFLOW;
      } else if (isgraph(c)) {  // Only allow printable char and no space
        // Store char
        session->buffer[session->buffer_ix] = c;
        session->buffer_ix++;
        if (SL_CLI_SIMPLE_PASSWORD_ECHO_PASSWORD) {
          sl_iostream_putchar(handle->iostream_handle, c);
        } else {
          sl_iostream_putchar(handle->iostream_handle, '*');
        }
      }
    } else {
      EFM_ASSERT(false);
    }
  } while (read);

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * @brief  timer callback
 ******************************************************************************/
static void on_lock_timeout(sl_sleeptimer_timer_handle_t *handle,
                            void *arg)
{
  Ecode_t ecode;
  (void)handle;
  cli_instance_data_session_t *session = (cli_instance_data_session_t *)arg;
  CORE_ATOMIC_SECTION(session->locked = false; \
                      session->wrong_password_cnt = 0; );

  lock_timer_running = false;
  retry_count = 0;
  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_LOCK_TIMER, &lock_timer_running, sizeof(lock_timer_running));
  nvm3_writeCounter(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER, retry_count);
  // Don't need to notify, by default we will wake up.

  EFM_ASSERT(ecode == ECODE_NVM3_OK);
}

/***************************************************************************//**
 * @brief  Configure timer
 ******************************************************************************/
static void configure_session_lock_timer(sl_cli_handle_t handle,
                                         cli_instance_data_session_t * session)
{
  Ecode_t ecode;
  uint32_t timeout = SL_CLI_SIMPLE_PASSWORD_LOCK_OUT_TIMEOUT_SEC * 1000;

  CORE_ATOMIC_SECTION(session->locked = true; );
  security_warning = true;
  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_WARN_FLAG, &security_warning, sizeof(security_warning));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_LOCK_OUT_MESSAGE);

  EFM_ASSERT(sl_sleeptimer_start_timer_ms(&session->timer, timeout, on_lock_timeout, session, 0, 0) == SL_STATUS_OK);

  lock_timer_running = true;

  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_LOCK_TIMER, &lock_timer_running, sizeof(lock_timer_running));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);
}

/***************************************************************************//**
 * @brief  Destroy key; Force new setup
 ******************************************************************************/
sl_status_t sl_cli_simple_password_destroy_key(void)
{
  psa_crypto_init();
  psa_destroy_key(CLI_SECURITY_PSA_CRYPTO_KEY_ID);
  CORE_ATOMIC_SECTION(module_state = CONFIGURE; );
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Reset Security Flag Command
 ******************************************************************************/
sl_status_t sl_cli_reset_security_warning_flag(void)
{
  Ecode_t ecode;
  bool warning = false;
  CORE_ATOMIC_SECTION(security_warning = false; );
  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_WARN_FLAG, &warning, sizeof(security_warning));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

