espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cli/src/sl_cli_simple_password.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Set new password
 ******************************************************************************/
sl_status_t sl_cli_set_simple_password(char *new_password)
{
  uint8_t hash[BLOCK_SIZE];
  size_t hash_len;
  Ecode_t ecode;
  psa_hash_operation_t operation;
  psa_status_t status;

  if (strlen(new_password) < SL_CLI_SIMPLE_PASSWORD_LENGTH_MIN) {
    return SL_STATUS_INVALID_SIGNATURE;
  }

  operation = psa_hash_operation_init();

  status = psa_hash_setup(&operation, PSA_ALG_SHA_256);
  EFM_ASSERT(status == PSA_SUCCESS);

  status = psa_hash_update(&operation, (uint8_t *)new_password, strlen(new_password));
  EFM_ASSERT(status == PSA_SUCCESS);

  status = psa_hash_finish(&operation, hash, sizeof(hash), &hash_len);
  EFM_ASSERT(status == PSA_SUCCESS);

  psa_hash_abort(&operation);

  EFM_ASSERT(status == PSA_SUCCESS);
  EFM_ASSERT(hash_len == sizeof(encrypted_password_hash));

  cipher_encrypt(iv, sizeof(iv),
                 hash, sizeof(hash),
                 encrypted_password_hash, sizeof(encrypted_password_hash), &hash_len);
  mbedtls_platform_zeroize(hash, sizeof(hash));

  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_ENCRYPTED_PASSWORD_HASH, encrypted_password_hash, sizeof(encrypted_password_hash));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_IV, iv, sizeof(iv));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  CORE_ATOMIC_SECTION(module_state = CONFIGURED; );

  return (SL_STATUS_OK);
}

/***************************************************************************//**
 * @brief  Initialize module
 *
 * @note  Must be called prior sl_cli_instance_init()
 ******************************************************************************/
sl_status_t sl_cli_simple_password_init(void)
{
  psa_key_id_t key_id;
  Ecode_t ecode;
  sl_status_t status;
  psa_status_t psa_status = psa_crypto_init();

  EFM_ASSERT(psa_status == PSA_SUCCESS);

  if (psa_is_key_present_in_storage(CLI_SECURITY_PSA_CRYPTO_KEY_ID)) {
    uint32_t obj_type;
    size_t obj_len;
    ecode = nvm3_getObjectInfo(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_ENCRYPTED_PASSWORD_HASH, &obj_type, &obj_len);
    EFM_ASSERT(obj_len <= SL_CLI_SIMPLE_PASSWORD_LENGTH_MAX);
    if (ecode == ECODE_NVM3_OK) {
      uint32_t count;
      ecode = nvm3_readData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_ENCRYPTED_PASSWORD_HASH, encrypted_password_hash, obj_len);
      EFM_ASSERT(ecode == ECODE_NVM3_OK);

      ecode = nvm3_readData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_IV, iv, sizeof(iv));
      EFM_ASSERT(ecode == ECODE_NVM3_OK);

      ecode = nvm3_readData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_WARN_FLAG, &security_warning, sizeof(security_warning));
      EFM_ASSERT(ecode == ECODE_NVM3_OK);

      ecode = nvm3_readData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_LOCK_TIMER, &lock_timer_running, sizeof(lock_timer_running));
      EFM_ASSERT(ecode == ECODE_NVM3_OK);

      ecode = nvm3_readCounter(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER, &count);
      EFM_ASSERT(ecode == ECODE_NVM3_OK);

      retry_count = (uint8_t)count;

      CORE_ATOMIC_SECTION(module_state = CONFIGURED; );

      return SL_STATUS_OK;
    } else {
      sl_cli_simple_password_destroy_key();
    }
  }

  status = generate_encryption_key(&key_id);
  EFM_ASSERT(status == SL_STATUS_OK);
  EFM_ASSERT(key_id == CLI_SECURITY_PSA_CRYPTO_KEY_ID);
  CORE_ATOMIC_SECTION(module_state = CONFIGURE; );

  // Set warning flag to false at first startup
  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_WARN_FLAG, &security_warning, sizeof(security_warning));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  // Set warning flag to false at first startup
  ecode = nvm3_writeData(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_LOCK_TIMER, &lock_timer_running, sizeof(lock_timer_running));
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  nvm3_writeCounter(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER, retry_count);
  EFM_ASSERT(ecode == ECODE_NVM3_OK);

  CORE_ATOMIC_SECTION(module_state = CONFIGURE; );

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Initialize CLI instance's session
 *
 *@note  This function is called for every CLI instance started.
 ******************************************************************************/
sl_status_t sli_cli_session_init(sl_cli_handle_t handle)
{
  cli_instance_data_session_t *session;
  state_t state;

  session = malloc(sizeof(cli_instance_data_session_t));
  EFM_ASSERT(session != NULL);

  sl_iostream_putchar(handle->iostream_handle, '\n');
  write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_WELCOME_MESSAGE);

  mbedtls_platform_zeroize(session, sizeof(*session));
  CORE_ATOMIC_SECTION(state = module_state; );
  switch (state) {
    case CONFIGURE:
    case CONFIGURING:   //Possible case with an RTOS
      CORE_ATOMIC_SECTION(session->state = INIT; );
      break;

    case CONFIGURED:
      CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; );
      if (lock_timer_running) {
        configure_session_lock_timer(handle, session);
      }
      break;

    default:
      EFM_ASSERT(false);
  }
  session->wrong_password_cnt = retry_count;
  handle->session_data = session;
  handle->req_prompt = false;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Session handler
 *
 * @note  This function return if the accssing the cli command is allowed or not.
 *
 * @note  This function can write or read from the CLI stream for asking session
 *        information in order to log the user.
 ******************************************************************************/
sl_status_t sli_cli_session_handler(sl_cli_handle_t handle)
{
  sl_cli_handle_t cli_init;
  state_t m_state;
  state_t s_state;
  bool locked;
  bool loop;
  cli_instance_data_session_t * session = (cli_instance_data_session_t *)handle->session_data;

