espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cli/src/sl_cli_simple_password.c
#if !defined(SL_CATALOG_KERNEL_PRESENT)
  handle->block_sleep = false;
#endif
  CORE_ATOMIC_SECTION(m_state = module_state;                  \
                      s_state = session->state;                \
                      cli_init = instance_initialize_password; \
                      locked = session->locked; );
  if (locked) {
    return SL_STATUS_PERMISSION;
  }

  if (s_state == LOGGED_IN) {
    return SL_STATUS_OK;
  } else if (m_state == (CONFIGURE | CONFIGURING)) {
    // If the key is destroyed at runtime. All users logged in are still allowed accessing the cli until it logout
    // First instance to log will configure the new password.
    if (m_state == CONFIGURING && cli_init != handle) {
      // Another instance started to configure the password. Do not allow more than 1
      // instance to configure an initial password
      return SL_STATUS_PERMISSION;
    } else if (m_state == CONFIGURED && s_state == WAITING_NEW_PASSWORD) {
      // Other instance has completed to configure the initial password. We cannot ask for
      // the password in order to get logged in.
      write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_CONFIGURED_BY_OTHER_INSTANCE);
      CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; );
      s_state = ASK_PASSWORD;
    }
  }

  do {
    bool print_prompt = false;
    bool read = false;

    loop = false;

    // Output message depending on the session states
    switch (s_state) {
      case INIT:
      case ASK_NEW_PASSWORD:
        // First access: Let ask an initial password
        sl_iostream_putchar(handle->iostream_handle, '\n');
        write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_ASK_PASSWORD_FIRST_START_MESSAGE);
        print_prompt = true;
        read = true;
        s_state = WAITING_NEW_PASSWORD;
        break;

      case ASK_NEW_PASSWORD_CONFIRMATION:
        // Store password provided and ask for a confirmation before setting it
        write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_NEW_PASSWORD_CONFIRMATION_MESSAGE);
        print_prompt = true;
        read = true;
        s_state = WAITING_NEW_PASSWORD_CONFIRMATION;
        break;

      case ASK_PASSWORD:
        // Not first access; Password already exist. Ask for it
        sl_iostream_putchar(handle->iostream_handle, '\n');
        if (security_warning) {
          write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_SECURITY_WARNING_FLAG);
        }
        write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_ASK_PASSWORD);
        print_prompt = true;
        read = true;
        s_state = WAITING_PASSWORD;
        break;

      case WAITING_NEW_PASSWORD_CONFIRMATION:
      case WAITING_NEW_PASSWORD:
      case WAITING_PASSWORD:
        // Still waiting to receive bytes from the stream.
        read = true;
        break;

      default:
        EFM_ASSERT(false);
        break;
    }

    if (print_prompt) {
      // When asking for information print a prompt
      sl_iostream_putchar(handle->iostream_handle, '\n');
      session->buffer_ix = 0;
    }

    CORE_ATOMIC_SECTION(session->state = s_state; );

    if (read) {
      // if user must provide information in order to configure or login
      sl_status_t status = read_until_line_feed(handle, session);
      if (status != SL_STATUS_OK) {
        return status;
      }
    }

    CORE_ATOMIC_SECTION(s_state = session->state; );

    switch (s_state) {
      case WAITING_NEW_PASSWORD:
        // Store first password received for validation with confirmation
        if (strlen(session->buffer) < SL_CLI_SIMPLE_PASSWORD_LENGTH_MIN) {
          write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_PASSWORD_TOO_SHORT);
          CORE_ATOMIC_SECTION(session->state = INIT; \
                              module_state = CONFIGURE; );
          return SL_STATUS_PERMISSION;
        }
        strcpy(session->tmp_password, session->buffer);
        s_state = ASK_NEW_PASSWORD_CONFIRMATION;
        CORE_ATOMIC_SECTION(session->state = ASK_NEW_PASSWORD_CONFIRMATION; );
        loop = true;
        break;

      case WAITING_NEW_PASSWORD_CONFIRMATION:
        // Validate the same password has been provide 2 times.
        if (strcmp(session->tmp_password, session->buffer) == 0) {
          // Password match, apply it
          sl_status_t status = sl_cli_set_simple_password(session->tmp_password);
          // Clear read buffer (Do not expose password)
          mbedtls_platform_zeroize(session->buffer, sizeof(session->buffer));
          switch (status) {
            case SL_STATUS_OK:
              write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_NEW_PASSWORD_CONFIGURED);
              break;
            case SL_STATUS_INVALID_SIGNATURE:
              write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_PASSWORD_TOO_SHORT);

              CORE_ATOMIC_SECTION(session->state = INIT; \
                                  module_state = CONFIGURE; );
              loop = false;
              return SL_STATUS_PERMISSION;
            default:
              EFM_ASSERT(false);
          }

          CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; \
                              module_state = CONFIGURED; );
#if !defined(SL_CATALOG_KERNEL_PRESENT)
          handle->block_sleep = true;   // Force cli to run
#endif
          return SL_STATUS_PERMISSION;  // Ask password to get logged in
        } else {
          // passwords do not match
          write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_CONFIRMATION_DO_NOT_MATCH);
          s_state = INIT;
          CORE_ATOMIC_SECTION(module_state = CONFIGURE; );
          loop = false;
        }
        break;

      case WAITING_PASSWORD:
        // Validate password provided to get logged in.
        if (is_valid_password(session->buffer)) {
          CORE_ATOMIC_SECTION(session->state = LOGGED_IN;      \
                              session->wrong_password_cnt = 0; \
                              retry_count = 0; );
          nvm3_writeCounter(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER, retry_count);
          write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_LOGGED_IN);
          handle->req_prompt = true;
          return SL_STATUS_OK;
        } else {
          // Wrong password
          write_string_lf(handle, SL_CLI_SIMPLE_PASSWORD_INVALID_PASSWORD);
          CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; );
          loop = true;

          CORE_ATOMIC_SECTION(session->wrong_password_cnt++; );
          if (retry_count < SL_CLI_SIMPLE_PASSWORD_MAX_RETRY) {
            retry_count++;
            nvm3_writeCounter(nvm3_defaultHandle, CLI_SECURITY_NVM3_KEY_ID_RETRY_COUNTER, retry_count);
          }

          if (session->wrong_password_cnt >= SL_CLI_SIMPLE_PASSWORD_MAX_RETRY) {
            configure_session_lock_timer(handle, session);
            return SL_STATUS_PERMISSION;
          } else {
            sl_iostream_putchar(handle->iostream_handle, '\n');
          }
        }
        // Clear read buffer(Do not expose password)
        mbedtls_platform_zeroize(session->buffer, sizeof(session->buffer));
        break;

      default:
        EFM_ASSERT(false);
        break;
    }

    CORE_ATOMIC_SECTION(s_state = session->state; );
  } while (loop);

  return SL_STATUS_FAIL;
}

/***************************************************************************//**
 * @brief  Logout
 ******************************************************************************/
sl_status_t sl_cli_simple_password_logout(sl_cli_handle_t handle)
{
  state_t s_state;
  state_t m_state;
  cli_instance_data_session_t * session = (cli_instance_data_session_t *)handle->session_data;
  CORE_ATOMIC_SECTION(s_state = session->state; \
                      m_state = module_state; );
  if (s_state == LOGGED_IN) {
    if (m_state == CONFIGURED) {
      CORE_ATOMIC_SECTION(session->state = ASK_PASSWORD; );
    } else {
      CORE_ATOMIC_SECTION(session->state = INIT; );
    }
  }

  handle->req_prompt = false;
#if !defined(SL_CATALOG_KERNEL_PRESENT)
  handle->block_sleep = true;   // Force cli to run before going to sleep
#endif

