espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cli/src/sl_cli_simple_password.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief  Log out command
 ******************************************************************************/
void cli_logout_cmd(sl_cli_command_arg_t * arguments)
{
  (void)arguments;
  sl_cli_simple_password_logout((sl_cli_handle_t)arguments->handle);
}

/***************************************************************************//**
 * @brief  Set new password command
 ******************************************************************************/
void cli_set_password_cmd(sl_cli_command_arg_t * arguments)
{
  char *password = sl_cli_get_argument_string(arguments, 0);
  char *new_password_1 = sl_cli_get_argument_string(arguments, 1);
  char *new_password_2 = sl_cli_get_argument_string(arguments, 2);
  sl_status_t status;

  if (strcmp(new_password_1, new_password_2) != 0) {
    write_string_lf((sl_cli_handle_t)arguments->handle, SL_CLI_SIMPLE_PASSWORD_CONFIRMATION_DO_NOT_MATCH);
    return;
  }

  if (psa_is_key_present_in_storage(CLI_SECURITY_PSA_CRYPTO_KEY_ID)) {
    if (!is_valid_password(password)) {
      write_string_lf((sl_cli_handle_t)arguments->handle, SL_CLI_SIMPLE_PASSWORD_INVALID_PASSWORD);
      return;
    }
  }

  status = sl_cli_set_simple_password(new_password_1);
  switch (status) {
    case SL_STATUS_OK:
      write_string_lf(arguments->handle, SL_CLI_SIMPLE_PASSWORD_NEW_PASSWORD_CONFIGURED);
      break;
    case SL_STATUS_INVALID_SIGNATURE:
      write_string_lf(arguments->handle, SL_CLI_SIMPLE_PASSWORD_PASSWORD_TOO_SHORT);
      break;
    default:
      EFM_ASSERT(false);
  }
}

/***************************************************************************//**
 * @brief  Reset Security Flag Command
 ******************************************************************************/
void cli_reset_security_warning_flag_cmd(sl_cli_command_arg_t * arguments)
{
  (void)arguments;

  EFM_ASSERT(sl_cli_reset_security_warning_flag() == SL_STATUS_OK);
}

/***************************************************************************//**
 * @brief  Destroy key command
 ******************************************************************************/
void cli_destroy_key_cmd(sl_cli_command_arg_t * arguments)
{
  (void)arguments;
  EFM_ASSERT(sl_cli_simple_password_destroy_key() == SL_STATUS_OK);
}
